import java.util.Arrays;

public class Haus4 {
    public static void main(String[] args) {
        // 11. Отсортировать массив строк по длине.
//        String[] array = {"elephant", "cat", "og"};
//
//        System.out.println("Original array: " + Arrays.toString(array));
//        Arrays.sort(array, (s1, s2) -> Integer.compare(s1.length(), s2.length()));
//
//        System.out.println("Sorted array: " + Arrays.toString(array));
//    }
//}

        // 12. Найти и вывести все строки одинаковой длины.
//        String[] array = {"apple", "banana", "cherry", "dog", "cat"};
//        for (int i = 0; i < array.length; i++) {
//            int currentLength = array[i].length();
//            for (int j = 0; j < array.length; j++) {
//                if (i != j && array[j].length() == currentLength) {
//                    System.out.println("stroka odinakovaya: " + array[i] + " и " + array[j]);
//                }
//            }
//        }
//    }
//}


    // 13. Сравнить содержимое двух массивов целых чисел.
//        int[] array1 = {1, 2, 3};
//        int[] array2 = {1, 2, 3};
//       Arrays.equals(array1, array2);
//
//
//        System.out.println("Arrays are equal: " + equals(array1, array2));
//        System.out.println("Arrays are not equal: " + !equals(array1, array2));

    }
}

    // 14. Генерация нового массива из сумм элементов двух массивов.

//        int[] array1 = {1, 2, 3};
//        int[] array2 = {4, 5, 6};
//    }

    // 15. Найти уникальные значения в массиве строк.
//
//        String[] array = {"apple", "banana", "apple", "cherry", "banana"};
//
//    }

    // 16. Удалить дубликаты из массива строк.
//
//        String[] array = {"apple", "banana", "apple", "cherry", "banana"};
//    }

    // 17. Объединить два массива строк в один.
//
//        String[] array1 = {"apple", "banana"};
//        String[] array2 = {"cherry", "date"};
//    }

    // 18. Проверить, упорядочен ли массив строк по алфавиту.
//
//        String[] array = {"apple", "banana", "cherry"};
//    }

    // 19. Найти строки, начинающиеся с заданной буквы.
//
//        String[] array = {"apple", "banana", "apricot", "cherry"};
//        char target = 'a';
//    }

    // 20. Создать массив строк из первых букв элементов другого массива.

//        String[] array = {"apple", "banana", "cherry"};
//    }
//}

